Repository: skornel02/duszamobile2021
Catalog: lib/l10n/intl_*.arb
Languages: hu

# appTitle
source: GreenGuardian
hu: ZöldŐr

# homePage
source: Flutter Demo Home Page
hu: Flutter demó otthon oldal

source: Home
hu: Főoldal

source: Cards
hu: Kártyák

source: Categories
hu: Kategóriák

source: Category
hu: Kategória

source: Balances
hu: Számlák

source: Balance
hu: Számla

source: Statistics
hu: Statisztikák

source: Cancel
hu: Mégsem

source: Save
hu: Mentés

source: Print statistics
hu: Statisztikák nyomtatása

source: Name
hu: Név

source: Add new
hu: Új hozzáadása

source: Remove
hu: Törlés

source: Creation
hu: Létrehozás

# areYouSure
source: Are you sure about that?
hu: Biztos a döntésében?

# new_title
source: New
hu: Új

source: Title
hu: Cím

# continueButton
source: Continue
hu: Következő

# finishButton
source: Finish
hu: Befejezés

source: Add new category
hu: Új kategória hozzáadása

source: Add new sub category
hu: Új alkategória hozzáadása

# categoryNameAlreadyInUse
source: Category name already exists!
hu: Kategória már létezik!

# subcategoryNameAlreadyInUse
source: Subcategory name already exists!
hu: Alkategória már létezik!

# categoryNameInUse
source: Category is in use!
hu: Kategória használatban van!

# subcategoryNameInUse
source: Subcategory is in use!
hu: Alkategéria használatban van!

# categoryCreated
source: Category created successfully!
hu: Kategória sikeresen létrehozva!

# subcategoryCreated
source: Subcategory created successfully!
hu: Alkategória sikeresen létrehozva!

source: Type
hu: Típus

source: Turn
hu: Forduló

# removeSuccessful
source: Removed successfully!
hu: Sikeres eltávolítás!

source: Add new balance!
hu: Új számla!

source: Advanced
hu: Részletes

source: Easy
hu: Egyszerű

source: Cash
hu: Készpénz

source: Debit
hu: Bankszámla

source: Credit
hu: Hitelszámla

source: Billing day
hu: Számlázási nap

# cantBeNull
source: Value can't be null
hu: Az érték nem lehet üres

# cantBeNegative
source: Value must be positive
hu: Az értéknek pozitívnak kell lennie

# mustBeWhole
source: Value must be a whole number
hu: Az értéknek egésznek kell lennie

# cantBeOver31
source: The day can't be bigger than 31
hu: A nap nem lehet több 31nél

# cantWithoutBalance
source: You cannot do that without having a balance first!
hu: Ez nem lehetséges számla nélkül!

# balanceCreated
source: Balance created successfully!
hu: Számla sikeresen létrehozva!

source: Spending limit
hu: Hitelkeret

# itemCreated
source: Item created successfully!
hu: Bejegyzés sikeresen létrehozva!

source: Amount
hu: Összeg

source: Income
hu: Bevétel

# outcome
source: Spending
hu: Kiadás

source: date category
hu: dátum ketegória

source: Specify amount
hu: Összeg meghatározása

source: Add name here
hu: Név megadása

source: Choose category
hu: Kategória kiválasztása

source: Choose date
hu: Dátum kiválasztása

source: Single
hu: Egyszeri

source: Monthly
hu: Havi

# selectBalance
source: Please select a balance!
hu: Kérjük válasszon ki egy számlát!

source: Accountwide balance
hu: Összes pénz

source: This month
hu: Jelenlegi hónap

source: Latest transactions
hu: Legutóbbi tranzakciók

# creditCards
source: Credit due dates
hu: Hitelszámla fordulók

source: Details
hu: Részletek

source: Export data
hu: Adatok exportálása

source: Export visuals
hu: Kimutatások exportálása

# amazonTrees
source: With this much money this number of trees could have been planted in the Amazonian rainforest:
hu: A megadott összegből ennyi fát lehetne ültetni az amazonasi esőerdőben:

source: Date
hu: Dátum

# accountMoneyHistory
source: Account history
hu: Számla történet

source: days remaining
hu: nap maradt

source: Over budget
hu: Túlhaladt a kereten

source: Not over budget
hu: Nem haladt túl a kereten

source: Spendings this month
hu: E havi költések

source: From balance
hu: Honnan

source: To balance
hu: Hova

source: New transaction
hu: Új tranzakció

source: Choose attachments
hu: Csatolmányok választása

source: Comparison per balance
hu: Számlánkénti összehasonlítás

# noRecordForAccount
source: No records for account
hu: Nincsenek számlához tartozó adatok

# clearCO
source: With this much money the below amount of COâ‚‚ could be cleared:
hu: Ennyi pénzből az alábbi mennyiségű CO₂-től lehetne megtísztítani a Földet:
